rule wk_demo_mitre_attack_T1140_encoded_powershell_command {
 
  meta:
    author = "Google Cloud Security"
    description = "Detects encoded powershell commands"
    mitre_attack_tactic = "Defense Evasion"
    mitre_attack_technique = "Deobfuscate/Decode Files or Information"
    mitre_attack_url = "https://attack.mitre.org/techniques/T1140/"
    mitre_attack_version = "v13.1"
    type = "hunt"
    platform = "Windows"
    data_source = "microsoft sysmon, microsoft windows events"
    severity = "Info"
    priority = "Info"

  events:
    $process.metadata.base_labels.namespaces = "LogStory"
    $process.metadata.event_type = "PROCESS_LAUNCH"
    $process.principal.hostname = $hostname
    re.regex($process.target.process.file.full_path, `(system32|syswow64)\\WindowsPowerShell\\v1\.0\\powershell(|\_ise)\.exe`) nocase
    re.regex($process.target.process.command_line, `(?i)(?:-enc|-ec|-en)\W+\S*`)
    $encoded_value = re.capture($process.target.process.command_line, `(?i)(?:-enc|-ec|-en)\W+(\S*)`)
    //$decoded_value = strings.base64_decode(re.capture($process.target.process.command_line, `(?i)(?:-enc|-ec|-en)\W+(\S*)`))


    //$hostname = re.replace($process.principal.hostname, `\.stackedpads.local`,"")


  match:
    $hostname over 5m

  outcome:
    $target_process_command_line = array_distinct($process.target.process.command_line)
    $encoded_powershell = array_distinct($encoded_value)
    //$decoded_powershell = array_distinct($decoded_value)
    //$decoded_powershell = array_distinct(strings.base64_decode(re.capture($process.target.process.command_line, `(?i)(?:-enc|-ec|-en)\s*(\S*)`)))

condition:
    $process
}
